print("سلام.\nمیخوایم کمی با سؤال و حساب و کتاب سرگرم بشیم.\nآماده ای؟ پس شروع میکنیم!")
p = 0
s1 = input("به عنوان سؤال اول میدونی اگه آب سر بالا بره قورباغه چه آوازی میخونه؟")
if "ابوعطا" in s1 or "ابو عطا" in s1:
    print("آفرین!\nحالا میریم سراغ سؤالات حساب و کتاب!")
    a1 = int(input("4 + 1"))
    if a1 == 5:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا میشه: ")
        print(p)
    a1 = int(input("5 - 3"))
    if a1 == 2:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
    a1 = int(input("5 + 3"))
    if a1 == 8:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
    a1 = int(input("4 - 1"))
    if a1 == 3:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
    a1 = int(input("2 + 10"))
    if a1 == 12:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود\nاین آخرین سؤال دور اول بود و امتیازاتت تا حالا بازم میشه: ")
        print(p)
else:
    print("نشد! جوابت درست نبود!\nتو این دور سؤالات حساب رو از دست دادی و امتیازی نمیگیری!\nولی بازم شاید بتونی شانست رو تو سؤال بعدی امتحان کنی!")
input("خب چرا معطلی؟! یه اینتر بزن بریم دور بعدی دیگه!")
s2 = input("خب به عنوان سؤال دوم بگو سرعت چی از هر چیزی بیشتره؟")
if "نور" in s2:
    print("آفرین!\nحالا میریم سراغ سؤالات حساب و کتاب!")
    a2 = int(input("4 - 4"))
    if a2 == 0:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
    a2 = int(input("2 + 2"))
    if a2 == 4:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
    a2 = int(input("5 - 4"))
    if a2 == 1:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
    a2 = int(input("7 + 13"))
    if a2 == 20:
        p = p + 10
        print("آفرین!\n10 امتیاز گرفتی.\nحالا جمع امتیازاتت شد: ")
        print(p)
    else:
        print("نشد!\nپاسخت غلط بود و امتیازت تا حالا بازم میشه: ")
        print(p)
a2 = input("خب آخرین سؤال دور دوم کمی فرق داره.\nبه نظرت حاصل تفریق توالی متوالی کدوم اعداد میشه اولین عدد اول؟ فرد، زوج یا هر دو؟\n")
    if a2 == "هر دو":
        print("آفرین! اینم درست جواب دادی و جمع امتیازاتت تا اینجا میشه: ")
        print(p)
    else:
        print("نشد! جوابش هر دو بود.\nپس جمع امتیازاتت بازم میشه: ")
        print(p)
else:
    print("نشد! جوابت درست نبود!\nتو این دور سؤالات حساب رو از دست دادی و امتیازی نمیگیری!\nولی بازم شاید بتونی شانست رو تو سؤال بعدی امتحان کنی!")
input("خب چرا معطلی؟! یه اینتر بزن بریم دور بعدی دیگه!")
print("حالا که فکرشو میکنم میبینم چرا هی زنجیره رو ادامه بدیم وقتی همه چیز مشخصه؟\nسید خواستی پنج تا سؤال اصلی داشته باشیم، ولی من نه حالشو دارم، نه وقتشو و نه اصولا فرقی میکنه!\nآخه روالش همینه دیگه!")
print("بنا بر این این بازی فرسایشی رو همین جا تموم میکنیم و نهایتا همون امتیازی که آخرین بار اعلام شد، میشه امتیاز نهاییت!\nامیدوارم صد امتیاز رو کامل گرفته باشی!\nامتیاز نهایی: \n")
print(p)
input("چیه داداش؟! نیگا میکنی؟! ببین اگه نمره کامل نگرفتی اعتراض معتراض وارد نیستا؟! یه اینتر بزن برنامه بسته بشه نمره ما رو هم اوکی کن دیگه!")
